<template>
  <div>
    <h1>Обо мне</h1>

<p>Я закончила Ростовский Медицинский Университет, педиатрический факультет с
отличием, первая специализация на базе Санкт-Петербургской Педиатрической Академии
по нефрологии, работала в Центре Восстановительной Медицины и Реабилитации №1
Ростовской области, как педиатр, затем нефролог.</p>

<b-row class="photos" no-gutters>
  <b-col><b-img thumbnail src="@/assets/1274.jpg" fluid alt="Анастасия Харченко" @click="showPhotoModal"/></b-col>
  <b-col><b-img thumbnail src="@/assets/1593.jpg" fluid alt="Анастасия Харченко" @click="showPhotoModal"/></b-col>
  <b-col><b-img thumbnail src="@/assets/family.jpg" fluid alt="Анастасия Харченко" @click="showPhotoModal"/></b-col>
</b-row>

<b-modal id="photo-modal" title="Анастасия Харченко" hide-footer centered>
  <b-img :src="modalPhotoSrc" fluid alt="Анастасия Харченко"/>
</b-modal>

<p>Мне интересно познавать разные сферы жизни и реализовываться в них, поэтому во время
учебы в университете успешно работала моделью (Modus Vivendis Москва, Next Paris),
журналистом и телеведущей (телеканал СТС-Ростов, ТНТ-Ростов).</p>

<p>За время долгого декрета (у меня трое замечательных детей и любящий муж) получила
сертификат по гомеопатии (но я не лечу гомеопатическими препаратами) и пополняла
свои знания в области диетологии и здорового питания.</p>

<p>Когда младший ребенок пошел в детский сад, у меня появилась возможность снова пойти
учиться! Я выбрала эндокринологию, наиболее развивающуюся и объединяющую весь
организм дисциплину. А после не хватало международного опыта в области
нутрициологии. Institute for Integrative Nutrition, в Нью-Йорке, стал той недостающей
частью пазла, чтобы сформировать свою картину видения медицины и человека, то чем я
могу поделиться и помочь моему пациенту.</p>

<p>Все мои рекомендации основаны исключительно на доказательной медицине с
холистическим взглядом на проблему. Мне важно, чтобы проблема или вопрос, с которым
обратился человек, была решена. Как врач я должна предоставить пациенту самые
современные подходы к обследованию и лечению в преломлении его индивидуальности.
Очень надеюсь, что уже после первой встречи, мой пациент получает не только
назначения, но и пересматривает свой образ жизни и питания, делая первый шаг в сторону
здоровья и благополучия!</p>
  </div>
</template>

<script>
  export default {
    name: 'about',

    data () {
      return {
        modalPhotoSrc: undefined
      }
    },

    methods: {
      showPhotoModal (event) {
        if (event.target.src)
        this.modalPhotoSrc = event.target.src
        this.$bvModal.show('photo-modal')
      }
    }
  }
</script>

<style lang="scss" scoped>
  .photos img {
    cursor: pointer;
  }
</style>
