<template>
  <div>

     <b-img src="../assets/1260.jpg" width="770" height="513" fluid alt="Анастасия Харченко"></b-img>

    <p>Здравствуйте! Меня зовут Анастасия Тараско, я врач эндокринолог, нутрициолог, а также сертифицированный тренер по здоровью (Health Coach, Institute for Integrative Nutrition, NYC).</p>
    <p>Рада вас приветствовать на сайте! Надеюсь, найденная здесь информация будет для вас интересной, полезной, а главное, послужит еще одной ступенькой к здоровью и благополучию.</p>

    <blockquote
      v-for="(o, i) in blockquotes"
      :key="`blockquote-${i}`"
    >
      {{ o }}
    </blockquote>

  </div>
</template>

<script>
  export default {
    name: 'view-home',

    data () {
      return {
        blockquotes: [
          'Одна и та же еда для одного человека польза, для другого вред.',
          'Состояние здоровья и счастья это не точка назначения, а путешествие.',
          'Залог успеха не в фанатичном следовании различным диетам и тенденциям, а в изменении образа жизни.',
          'Если вы ищущий, творческий человек, то исключение каких-либо веществ из вашего рациона, например сахара или глиадина, откроет такое разнообразие блюд и продуктов, какое вы не могли и представить до этого. Кроме того, вы обретете новых друзей и единомышленников!',
          'То, что питает тело человека очень важно, но то, что питает его душу - гораздо важнее.'
        ]
      }
    }
  }
</script>

<style lang="scss" scoped>
  blockquote {
    margin: 2rem 0 2rem 0;
    padding-top: 10px;
    padding-left: 70px;
    background-image: url('../assets/logo.svg');
    background-size: 7%;
    background-repeat: no-repeat;
    background-position: 20px 0;
    max-width: 35rem;
  }
</style>
